In [3]:
import pandas as pd
import numpy as np

data = {'Nome': ['Alice', 'Bob', 'Charlie', 'David', 'Emma'],
        'Età': [25, 30, 35, 40, 22],
        'Sesso': ['F', 'M', 'M', 'M', 'F'],
        'Punteggio': [85, 90, 88, 92, 78]}

df = pd.DataFrame(data)
df

      Nome  Età Sesso  Punteggio
0    Alice   25     F         85
1      Bob   30     M         90
2  Charlie   35     M         88
3    David   40     M         92
4     Emma   22     F         78

In [4]:
# 1. Seleziona solo la colonna 'Nome'
df['Nome']

0      Alice
1        Bob
2    Charlie
3      David
4       Emma
Name: Nome, dtype: object

In [5]:
# 2. Seleziona le colonne 'Nome' e 'Età'
df[['Nome', 'Età']]

      Nome  Età
0    Alice   25
1      Bob   30
2  Charlie   35
3    David   40
4     Emma   22

In [6]:
# 3. Filtra le righe dove l'età è superiore a 30
df[df['Età'] > 30]

      Nome  Età Sesso  Punteggio
2  Charlie   35     M         88
3    David   40     M         92

In [7]:
# 4. Aggiungi una nuova colonna chiamata 'Voto' con valori casuali tra 60 e 100
import numpy as np
df['Voto'] = np.random.randint(60, 101, len(df)) # df.shape[0]
df

      Nome  Età Sesso  Punteggio  Voto
0    Alice   25     F         85    69
1      Bob   30     M         90    73
2  Charlie   35     M         88    80
3    David   40     M         92    80
4     Emma   22     F         78    68

In [8]:
# 5. Ordina il DataFrame in base alla colonna 'Punteggio' in ordine decrescente
df.sort_values(by='Punteggio', ascending=False)

      Nome  Età Sesso  Punteggio  Voto
3    David   40     M         92    80
1      Bob   30     M         90    73
2  Charlie   35     M         88    80
0    Alice   25     F         85    69
4     Emma   22     F         78    68

In [9]:
# 6. Calcola la media dei punteggi
df['Punteggio'].mean()

86.6

In [42]:
# 7. Trova la persona con il punteggio massimo
df['Punteggio'].idxmax() #row id with max value of series
df.loc[df['Punteggio'].idxmax()]

Nome         David
Età             40
Sesso            M
Punteggio       92
Voto            99
Name: 3, dtype: object

In [43]:

# 8. Cambia il sesso di 'Alice' a 'test'
df.loc[df['Nome'] == 'Alice', 'Sesso'] = 'test'
df

      Nome  Età Sesso  Punteggio  Voto
0    Alice   25  test         85    67
1      Bob   30     M         90    90
2  Charlie   35     M         88    88
3    David   40     M         92    99
4     Emma   22     F         78    84

In [44]:
# 9. Conta il numero di persone per sesso
df['Sesso'].value_counts()

M       3
test    1
F       1
Name: Sesso, dtype: int64

In [45]:
# 10. Rimuovi la colonna 'Voto'
df.drop('Voto', axis=1)

      Nome  Età Sesso  Punteggio
0    Alice   25  test         85
1      Bob   30     M         90
2  Charlie   35     M         88
3    David   40     M         92
4     Emma   22     F         78

In [46]:
# 11. Calcola la somma cumulativa della colonna 'Età'
df['Età'].cumsum()

0     25
1     55
2     90
3    130
4    152
Name: Età, dtype: int64

In [47]:
# 12. Trova le persone con punteggio superiore a 80 e età inferiore a 35
df[(df['Punteggio'] > 80) & (df['Età'] < 35)]

    Nome  Età Sesso  Punteggio  Voto
0  Alice   25  test         85    67
1    Bob   30     M         90    90

In [48]:
# 13. Calcola la deviazione standard della colonna 'Punteggio'
df['Punteggio'].std()

5.458937625582473

In [49]:
# 14. Raggruppa il DataFrame per sesso e calcola la media delle età
df.groupby('Sesso')['Età'].mean()

Sesso
F       22.0
M       35.0
test    25.0
Name: Età, dtype: float64

In [50]:
# 15. Rinomina la colonna 'Nome' in 'Cognome'
df = df.rename(columns={'Nome': 'Cognome'})
df

   Cognome  Età Sesso  Punteggio  Voto
0    Alice   25  test         85    67
1      Bob   30     M         90    90
2  Charlie   35     M         88    88
3    David   40     M         92    99
4     Emma   22     F         78    84

In [51]:
# 16. Fai una fusione (merge) con un secondo DataFrame
data2 = {'Cognome': ['Alice', 'Bob', 'Charlie', 'David', 'Emma'],
         'Lavoro': ['Ingegnere', 'Analista', 'Manager', 'Programmatore', 'Designer']}
df2 = pd.DataFrame(data2)
df2

   Cognome         Lavoro
0    Alice      Ingegnere
1      Bob       Analista
2  Charlie        Manager
3    David  Programmatore
4     Emma       Designer

In [52]:
pd.merge(df, df2, on='Cognome')

   Cognome  Età Sesso  Punteggio  Voto         Lavoro
0    Alice   25  test         85    67      Ingegnere
1      Bob   30     M         90    90       Analista
2  Charlie   35     M         88    88        Manager
3    David   40     M         92    99  Programmatore
4     Emma   22     F         78    84       Designer

In [53]:
# 17. Salva il DataFrame in un file CSV
df.to_csv('dati.csv', index=False)

In [54]:
# 18. Carica un DataFrame da un file CSV
df_caricato = pd.read_csv('dati.csv')
df_caricato

   Cognome  Età Sesso  Punteggio  Voto
0    Alice   25  test         85    67
1      Bob   30     M         90    90
2  Charlie   35     M         88    88
3    David   40     M         92    99
4     Emma   22     F         78    84

In [55]:
# 19. Aggiungi una riga al DataFrame
nuova_riga = {'Cognome': 'Frank', 'Età': 28, 'Sesso': 'M', 'Punteggio': 75, 'Voto': 89}
df = df.append(nuova_riga, ignore_index=True)
df

C:\Users\danie\AppData\Local\Temp\ipykernel_15712\749227175.py:3: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  df = df.append(nuova_riga, ignore_index=True)

   Cognome  Età Sesso  Punteggio  Voto
0    Alice   25  test         85    67
1      Bob   30     M         90    90
2  Charlie   35     M         88    88
3    David   40     M         92    99
4     Emma   22     F         78    84
5    Frank   28     M         75    89